tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
# GNU internationalization (i18n) and localization (l10n) library
brew "gettext"
# Command-line interface for SQLite
brew "sqlite"
# Core application library for C
brew "glib"
# Network backup and restore
brew "burp"
# C unit testing framework
brew "check"
# Generate documentation for several programming languages
brew "doxygen"
# OpenType text shaping engine
brew "harfbuzz"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Play, record, convert, and stream audio and video
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# GitHub command-line tool
brew "gh"
# C++ interface to glib
brew "glibmm"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Directory/file & DNS busting tool written in Go
brew "gobuster"
# Toolkit for creating graphical user interfaces
brew "gtk+3"
# Integrates GTK macOS applications with the Mac desktop
brew "gtk-mac-integration"
# Simple zero-configuration command-line HTTP server
brew "http-server"
# Interactive computing in Python
brew "ipython"
# Library for JSON, based on GLib
brew "json-glib"
# Simple terminal UI for git commands
brew "lazygit"
# Implementation of the file(1) command
brew "libmagic"
# Library to render SVG files using Cairo
brew "librsvg"
# Powerful, lightweight programming language
brew "lua"
# Fast and user friendly build system
brew "meson"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Development kit for the Java programming language
brew "openjdk"
# General-purpose scripting language
brew "php"
# Manage compile and link flags for libraries
brew "pkg-config"
# Package compiler and linker metadata toolkit
brew "pkgconf", link: false
# Fast, disk space efficient package manager
brew "pnpm"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Theme for zsh
brew "powerlevel10k"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Tools for creating native apps for Android and iOS
brew "react-native-cli"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Software for mathematics, science, and engineering
brew "scipy"
# User interface to the TELNET protocol
brew "telnet"
# Terminal multiplexer
brew "tmux"
# Language for application scale JavaScript development
brew "typescript"
# Fast static site generator in a single binary with everything built-in
brew "zola"
# Build desktop apps with JavaScript, HTML, and CSS
cask "electron"
# Clipboard manager
cask "maccy"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Music streaming service
cask "spotify"
vscode "akamud.vscode-javascript-snippet-pack"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "equinusocio.vsc-community-material-theme"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "formulahendry.dotnet-test-explorer"
vscode "fwcd.kotlin"
vscode "hamza-aziane.obsidian-dark"
vscode "hnw.vscode-auto-open-markdown-preview"
vscode "ionide.ionide-fsharp"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jorgeserrano.vscode-csharp-snippets"
vscode "kreativ-software.csharpextensions"
vscode "mathiasfrohlich.kotlin"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "ritwickdey.liveserver"
vscode "twxs.cmake"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vscjava.vscode-gradle"
vscode "vscodevim.vim"
vscode "xabikos.javascriptsnippets"
vscode "xadillax.viml"
