tap "homebrew/bundle"
tap "homebrew/services"
tap "jesseduffield/lazygit"
brew "gettext"
brew "glib"
brew "python@3.12"
brew "bat"
brew "black"
brew "burp"
brew "icu4c@76"
brew "cake"
brew "check"
brew "clang-format"
brew "cmake"
brew "php"
brew "composer"
brew "cpm"
brew "docker"
brew "doxygen"
brew "harfbuzz"
brew "libass"
brew "pango"
brew "tesseract"
brew "ffmpeg"
brew "fish"
brew "fzf"
brew "gcc"
brew "gh"
brew "glfw"
brew "glibmm"
brew "gnupg"
brew "go"
brew "gobuster"
brew "gtk+3"
brew "gtk-mac-integration"
brew "htop"
brew "node"
brew "http-server"
brew "inetutils", link: false
brew "ipython"
brew "json-glib"
brew "jupyterlab"
brew "lazygit"
brew "libmagic"
brew "librsvg"
brew "llvm"
brew "lua"
brew "numpy"
brew "py3cairo"
brew "scipy"
brew "manim"
brew "meson"
brew "mysql", restart_service: true
brew "neovim"
brew "openjdk"
brew "openvpn"
brew "pgloader"
brew "pipx"
brew "pkgconf"
brew "pnpm"
brew "poppler"
brew "postgresql@14"
brew "powerlevel10k"
brew "python@3.11"
brew "react-native-cli"
brew "ripgrep"
brew "telnet"
brew "tmux"
brew "tree"
brew "typescript"
brew "vercel-cli"
brew "xclip"
brew "zola"
cask "alt-tab"
cask "anaconda"
cask "electron"
cask "font-fira-code"
cask "maccy"
cask "mactex"
cask "sequel-ace"
cask "spotify"
cask "vlc"
vscode "akamud.vscode-javascript-snippet-pack"
vscode "brapifra.phpserver"
vscode "dbaeumer.vscode-eslint"
vscode "devsense.composer-php-vscode"
vscode "devsense.intelli-php-vscode"
vscode "devsense.phptools-vscode"
vscode "devsense.profiler-php-vscode"
vscode "donjayamanne.githistory"
vscode "dsznajder.es7-react-js-snippets"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.code-runner"
vscode "formulahendry.dotnet-test-explorer"
vscode "fwcd.kotlin"
vscode "hamza-aziane.obsidian-dark"
vscode "hnw.vscode-auto-open-markdown-preview"
vscode "ionide.ionide-fsharp"
vscode "jeff-hykin.better-cpp-syntax"
vscode "jorgeserrano.vscode-csharp-snippets"
vscode "kreativ-software.csharpextensions"
vscode "leanprover.lean4"
vscode "mathiasfrohlich.kotlin"
vscode "mkloubert.vscode-http-client"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-pack"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-python.black-formatter"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.vscode-typescript-next"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-mysql"
vscode "ritwickdey.liveserver"
vscode "sainnhe.sonokai"
vscode "twxs.cmake"
vscode "visualstudiotoolsforunity.vstuc"
vscode "vscjava.vscode-gradle"
vscode "vscodevim.vim"
vscode "xabikos.javascriptsnippets"
vscode "xadillax.viml"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "zobo.php-intellisense"
